emacs/.emacs.d/Readme.org
*** Projectile

[[https://github.com/bbatsov/projectile][Projectile]] Project interaction library for emacs.

#+begin_src emacs-lisp
  (use-package projectile
    :custom
    (projectile-sort-order 'recently-active)
    :config
    (projectile-global-mode)
    :init
      (setq projectile-enable-caching t)
      ;; Custom mode line
      (setq projectile-mode-line '(:eval (format " Ⓟ[%s]" (projectile-project-name))))
    :bind-keymap ("C-c p" . projectile-command-map))
#+end_src

**** Expand region
#+BEGIN_QUOTE
Expand region increases the selected region by semantic units. Just keep pressing the key until it selects what you want.

[[https://github.com/magnars/expand-region.el]]
#+END_QUOTE

- expand selection with =C-==
- contract with negative argument =M--= then =C-==

 #+begin_src emacs-lisp
 (use-package expand-region
   :bind
   ("C-=" . er/expand-region))
 #+end_src

**** Multiple Cursors

 [[https://github.com/magnars/multiple-cursors.el][multiple-cursors.el]] This package can create several cursors to all do the same things.

 #+begin_src emacs-lisp
   (use-package multiple-cursors
     :bind
     (("C-S-c C-S-c" .  mc/edit-lines)
      ("C-$" .  mc/edit-ends-of-lines)
      ("C-S-b" .  mc/edit-beginnings-of-lines)
      ("C-<" .  mc/mark-previous-word-like-this)
      ("C->" .  mc/mark-next-word-like-this)
      ("C-S-n" .  mc/mark-next-like-this)
      ("C-S-p" .  mc/mark-previous-like-this)
      ("C-*" .  mc/mark-all-dwim)))
 #+end_src

**** Treemacs
**** Undo Tree
 This lets you use =C-x u= (=undo-tree-visualize=)
 #+begin_src emacs-lisp
   (use-package undo-tree
     :diminish undo-tree-mode
     :config
     (progn
       (global-undo-tree-mode)
       (setq undo-tree-visualizer-timestamps t)
       (setq undo-tree-visualizer-diff t)))
 #+end_src


**** Yasnippet
** Programming
** Org
** =(provide 'init)=
This concludes the =init.el= file.

#+begin_src emacs-lisp
;; test
  (provide 'init)
    ;;; init.el ends here
#+end_src

# Local Variables:
# eval: (add-hook 'after-save-hook #'org-babel-tangle nil t)
# End:
